CRIS67/Robot-holonome/Programmation/dsPIC/Holonome.X/main.c
/*
 * File:   main.c
 * Author: Quentin BOYER
 *
 * Created on September 18, 2017, 6:59 PM
 */

#include <xc.h>
#include <math.h>
#include <p33EP512GM310.h>
#include <stdint.h>
#include "constant.h"
#include "clock.h"
#include "GPIO.h"
#include "timer.h"
#include "PWM.h"
#include "QEI.h"
#include "PID.h"
#include "SPI.h"
#include "ADC.h"
#include "UART.h"
#include "interrupt.h"
#include "US.h"
#include "AX12.h"
#include "DMA.h"



void testAccMax();
void reglageDiametre();
void straightPath(double cx, double cy, double ct, double speedMax, double accMax);
void go(double cx, double cy, double speedMax, double accMax);
void goBack(double cx, double cy, double speedMax, double accMax);
void turn(double ct);
void turnNOLIMIT(double ct);

void modif_straightPath(double arg_cx, double arg_cy, double arg_ct, double arg_speedMax, double accMax);

void test();
void test2();
void testPWM();
void testSPI();
void testADC();
void testInterrupt();
void testDelay();

//Global variables
//char TX[TX_SIZE];
char RX[RX_SIZE];
char unsigned TX_i;
char unsigned RX_i;
/*Current position*/
volatile long double x;
volatile long double y;
volatile long double theta;
/*Current setpoint position*/
volatile long double xc;
volatile long double yc;
volatile long double thetac;
/*Final setpoint position*/
volatile long double xf;
volatile long double yf;
volatile long double tf;

uint8_t finalPoint = 1;

volatile PID pidSpeedLeft, pidSpeedRight, pidDistance, pidAngle;
volatile PID pidSpeed0, pidSpeed1, pidSpeed2;
int state = 0;
int R,L;

//volatile char arrived;
volatile char arrived_2;

extern volatile char   US_ON[NB_US];
extern volatile char   US_R[NB_US];
extern volatile double US[NB_US];

volatile char sendBT = 0;

extern volatile double receivedX,receivedY,receivedTheta;
extern volatile unsigned char newPosReceived;
extern volatile unsigned char newPosBackReceived;
extern volatile unsigned char newAngleReceived;
extern volatile unsigned char back;

extern volatile unsigned char debugPosRpi;

volatile unsigned char stop = 0;

unsigned char detectUS = 0;
unsigned char sensDetectUS = 1;

extern double var_ACC_MAX;

// <editor-fold defaultstate="collapsed" desc="Génération de trajectoire">
extern unsigned char statePathGeneration;
extern unsigned char stateTrap;

extern double cx, cy, ct;

extern double sign;

extern double phi;
extern double angle;

extern double theta0;
extern double angularVelocity;
extern double prevAngularVelocity;
extern double maxAngularVelocity;

extern double AngularAcceleration;

extern double angle1;


extern double dx;
extern double dy;
extern double alpha;

extern double totalDistance;
extern double dist;

extern double y_0;
extern double x_0;
extern double speed;
extern double precSpeed;

extern double acc;
extern double speedMax;

extern double dist1; // </editor-fold>

extern uint8_t BufferA[8];
extern volatile uint8_t RxDMABuffer[RX_DMA_SIZE];
extern uint16_t start;

extern uint16_t iD2,iF2;

volatile uint8_t verbose = 0;

volatile int16_t tick0 = 0;
volatile int16_t tick1 = 0;
volatile int16_t tick2 = 0;

volatile double funSpeed = 1000;
volatile double funAcc = 1000;

volatile double funAngularSpeed = 10;
volatile double funAngularAcc = 1;

volatile long double linSpeed = 0;  //mm/s
volatile long double linAcc = 0;    //mm/s^2
volatile long double rotSpeed = 0;  //rad/s
volatile long double rotAcc = 0;    //rad/s^2

int sens = 0;


volatile long double kahanErrorX;
volatile long double kahanErrorY;
volatile long double kahanErrorT;

volatile uint8_t arrived = 1;

extern volatile long double alphaDebug;

int main(){
    initClock(); //Clock 140 MHz
    initGPIO();
    initPWM();
    //initQEI();
    initDMA();
    initUART();
    //initAX12();
    initInt();
    
    initAllPID(&pidSpeed0, &pidSpeed1, &pidSpeed2, &pidDistance, &pidAngle);

    initTimer();
    //initUS();
    initADC();
    //initSPI();
    
    
    //uint16_t w = 0;
    //uint16_t w2 = 0;
    
    initPWM();
    //int iLed = 0;
    x = 1000;
    y = 1500;
    xc = x;
    yc = y;
    xf = x;
    yf = y;
    theta = 0;
    /*while(!verbose){
        CheckMessages();
    }*/
    /*while(1){
        plot(1,(uint32_t)((int32_t)(tick0)));
        delay_ms(10);
        CheckMessages();
    }*/
    double iMotor = 0;
    int16_t saveTick0 = tick0;
    int16_t saveTick1 = tick1;
    int16_t saveTick2 = tick2;
    
    stop = 1;
    while(1){
        CheckMessages();
        pidAngle.setPoint = thetac;
        sendPos();
        if(newPosReceived){
                
                statePathGeneration = 42;
                delay_ms(100);
                newPosReceived = 0;
                
                modif_straightPath(receivedX,receivedY,0,linSpeed,linAcc);
        }
        delay_ms(50);
        /*plot(11,(uint32_t)((int32_t)(xc)));
        plot(12,(uint32_t)((int32_t)(x)));
        plot(21,(uint32_t)((int32_t)(yc)));
        plot(22,(uint32_t)((int32_t)(y)));*/
        //plot(1,(uint32_t)((int32_t)(pidAngle.setPoint*1800/PI)));
        plot(2,(uint32_t)((int32_t)(theta*1800/PI)));
        //plot(3,(uint32_t)((int32_t)(alphaDebug*1800/PI)));
        plot(4,(uint32_t)((int32_t)(PWM_0)));
        plot(5,(uint32_t)((int32_t)(PWM_1)));
        plot(6,(uint32_t)((int32_t)(PWM_2)));
    }
    while(1){
        /*setSetPoint(&pidSpeed0,0);
        setSetPoint(&pidSpeed1,0);
        setSetPoint(&pidSpeed2,0);*/
        
        //setSetPoint(&pidAngle,0);
        xc = 1100;
        xf = 1100;
        while(stop){
            CheckMessages();
            sendPos();
            delay_ms(10);
        }
        xc = 1000;
        xf = 1000;
        //setSetPoint(&pidAngle,2*PI);
        
        /*setSetPoint(&pidSpeed0,1);
        setSetPoint(&pidSpeed1,-1);
        setSetPoint(&pidSpeed2,0);*/
        while(!stop){
            CheckMessages();
            sendPos();
            delay_ms(10);
        }
    }
    while(1){
        CheckMessages();
        sendPos();
        delay_ms(10);
    }
    while(1){
        x = 1000;
        xf = 1100;
        xc = 1100;
        y = 1500;
        yf = y;
        yc = y;
        for(iMotor = 0; iMotor < 500; iMotor++){
            CheckMessages();
            sendPos();
            delay_ms(10);
        }
        x = 1100;
        xf = 1000;
        xc = 1000;
        y = 1500;
        yf = y;
        yc = y;
        for(iMotor = 0; iMotor < 500; iMotor++){
            CheckMessages();
            sendPos();
            delay_ms(10);
        }
    }
    while(1){
        /*setSetPoint(&pidSpeed0,1);
        setSetPoint(&pidSpeed1,-1);
        setSetPoint(&pidSpeed2,0);*/
        xf = 1200;
        for(xc = 1000; xc < 1200; xc++){
            CheckMessages();
            sendPos();
            delay_ms(20);
        }
        for(iMotor = 0; iMotor < 200; iMotor++){
            CheckMessages();
            sendPos();
            delay_ms(10);
        }
        /*setSetPoint(&pidSpeed0,-1);
        setSetPoint(&pidSpeed1,1);
        setSetPoint(&pidSpeed2,0);*/
        xf = 1000;
        for(xc = 1200; xc > 1000; xc--){
            CheckMessages();
            sendPos();
            delay_ms(20);
        }
        for(iMotor = 0; iMotor < 200; iMotor++){
            CheckMessages();
            sendPos();
            delay_ms(10);
        }
    }
    while(1){
        for(iMotor = 10; iMotor < 50; iMotor+=0.02){
            delay_ms(20);
            int32_t s0 = tick0 - saveTick0;
            int32_t s1 = tick1 - saveTick1;
            int32_t s2 = tick2 - saveTick2;
            saveTick0 = tick0;
            saveTick1 = tick1;
            saveTick2 = tick2;
            motor(0,iMotor);
            motor(1,iMotor);
            motor(2,iMotor);
            plot(1,(uint32_t)((int32_t)(iMotor*100)));
            plot(2,(uint32_t)((int32_t)(s0)));
            plot(3,(uint32_t)((int32_t)(s1)));
            plot(4,(uint32_t)((int32_t)(s2)));
            plot(5,(uint32_t)((int32_t)(PWM_0)));
        }
        sendMotor(0,0,0);
        delay_ms(2000);
        for(iMotor = 0; iMotor >-50; iMotor--){
            delay_ms(100);
            int32_t s0 = tick0 - saveTick0;
            int32_t s1 = tick1 - saveTick1;
            int32_t s2 = tick2 - saveTick2;
            saveTick0 = tick0;
            saveTick1 = tick1;
            saveTick2 = tick2;
            motor(0,iMotor);
            motor(1,iMotor);
            motor(2,iMotor);
            plot(1,(uint32_t)((int32_t)(iMotor*10)));
            plot(2,(uint32_t)((int32_t)(s0)));
            plot(3,(uint32_t)((int32_t)(s1)));
            plot(4,(uint32_t)((int32_t)(s2)));
        }
        sendMotor(0,0,0);
        delay_ms(2000);
    }
    /*while(1){
        plot(1,(uint32_t)((int32_t)(millis())));
        delay_ms(50);
    }*/
    /*for(iMotor = 0; iMotor < 100; iMotor++){
            delay_ms(20);
            int32_t s0 = tick0 - saveTick0;
            int32_t s1 = tick1 - saveTick1;
            int32_t s2 = tick2 - saveTick2;
            saveTick0 = tick0;
            saveTick1 = tick1;
            saveTick2 = tick2;
            motor(0,iMotor);
            motor(1,iMotor);
            motor(2,iMotor);
            plot(1,(uint32_t)((int32_t)(iMotor)));
            plot(2,(uint32_t)((int32_t)(s0)));
            plot(3,(uint32_t)((int32_t)(s1)));
            plot(4,(uint32_t)((int32_t)(s2)));
        }
        for(iMotor = 100; iMotor > -100; iMotor--){
            delay_ms(20);
            int32_t s0 = tick0 - saveTick0;
            int32_t s1 = tick1 - saveTick1;
            int32_t s2 = tick2 - saveTick2;
            saveTick0 = tick0;
            saveTick1 = tick1;
            saveTick2 = tick2;
            motor(0,iMotor);
            motor(1,iMotor);
            motor(2,iMotor);
            plot(1,(uint32_t)((int32_t)(iMotor)));
            plot(2,(uint32_t)((int32_t)(s0)));
            plot(3,(uint32_t)((int32_t)(s1)));
            plot(4,(uint32_t)((int32_t)(s2)));
        }
        for(iMotor = -100; iMotor < 0; iMotor++){
            delay_ms(20);
            int32_t s0 = tick0 - saveTick0;
            int32_t s1 = tick1 - saveTick1;
            int32_t s2 = tick2 - saveTick2;
            saveTick0 = tick0;
            saveTick1 = tick1;
            saveTick2 = tick2;
            motor(0,iMotor);
            motor(1,iMotor);
            motor(2,iMotor);
            plot(1,(uint32_t)((int32_t)(iMotor)));
            plot(2,(uint32_t)((int32_t)(s0)));
            plot(3,(uint32_t)((int32_t)(s1)));
            plot(4,(uint32_t)((int32_t)(s2)));
        }
    sendMotor(0,0,0);*/
    
    while(1){   /*Chenillard*/
        LATFbits.LATF5  = 0;
        LATGbits.LATG3  = 1;
        delay_ms(100);
        LATGbits.LATG3  = 0;
        LATFbits.LATF4  = 1;
        delay_ms(100);
        LATFbits.LATF4  = 0;
        LATFbits.LATF5  = 1;
        delay_ms(100);
        CheckMessages();
        //sendLog("hello there =) !\n");
    }
    return 0;
}

void testAccMax(){
    double commandeL = 12;
    double prevCommandeL = 0;
    double delta = 0.1;
    double newCL;
    while(1){
        if(commandeL - prevCommandeL > delta)
            newCL = prevCommandeL + delta;
        else if(commandeL - prevCommandeL < -delta)
            newCL = prevCommandeL - delta;
        else
            newCL = commandeL;
        prevCommandeL = newCL;
        //sendToMotor(0,newCL);
        delay_ms(30);
    }
}
void reglageDiametre(){
    IEC0bits.T1IE = 0;
    POS1CNTL = 0x8000;
    POS2CNTL = 0x8000;
    double l,r,l2,r2;
    double D1,D2;
    while(1){
        l = (double)(POS1CNTL - 0x8000) * PI * 2 * ENCODER_WHEEL_RADIUS / 4096;
        r = (POS2CNTL - 0x8000) * PI * 2 * ENCODER_WHEEL_RADIUS / 4096;
        l2 = (double)(POS1CNTL - 0x8000) * PI * 2 / 4096;
        r2 = (double)(POS2CNTL - 0x8000) * PI * 2 / 4096;
        D1 = 300/l2;
        D2 = 300/r2;
        
        /*print("l : ");
        print(itoa((int)l));
        print("      r : ");
        print(itoa((int)r));
        print("      D1 : ");
        print(itoa((int)(D1)));
        print("      D1*100 : ");
        print(itoa((int)(D1*100)));
        print("      D2 : ");
        print(itoa((int)(D2)));
        print("      D2*100 : ");
        print(itoa((int)(D2*100)));
       
